# 1.定义两个整数变量，计算这两个变量的和，并将结果打印输出
# 2.定义两个整型变量，比较他们的值，并打印输出
# 3.计算1+2+..+100的和
# 4.统计1,2,3,4能组成多少个不同的三位数
# 5.打印99乘法表
# 6.计算所有水仙花的值
#1.定义两个整数变量，计算这两个变量的和，并将结果打印输出
# num1 = input ('请输入数字1：')
# num2 = input ('请输入数字2：')
# print(int(num1) + int(num2))  # num1和num2分别为字符串型，需要用int强制转为整数型。
#2.定义两个整型变量，比较他们的值，并打印输出
# a = input('num1:')
# b = input('num2:')
# if a > b:
#     print("a>b")
# elif a == b:
#     print("a=b")
# else:
#     print('a<b')
#3.计算1+2+..+100的和
# s = 0  #for循环
# for i in range(1,101):
#     s += i
# print(f"等于{s}")
# s = 0   #定义一个变量存储值
# i = 0   #定义循环次数
# while i < 101:   # for while等寻遵化左闭右开 即【1,100）
#     s += i  #循坏第一次s += i 即s= s+i 即把第一次的i值赋值给s
#     i += 1  #每次s=s+i完成后，给i值加1，直到i=101结束循坏
# print(s)    #打印输出s值
#4.统计1,2,3,4能组成多少个不同的三位数
# count = 0  #定义打印次数count
# for i in range(1,5): #每次从1-5取四个数字1,2，3，4
#     for j in range(1,5): # 取完百位后，取十位数字
#         for k in range(1,5):  # 取个位数字
#             if i != j and i != k and j != k: #百十个位不能相同，条件判断。
#                 count += 1 #三位数字不相同则打印次数+1
#                 print(i,j,k,sep = '',end = " ")  # 然后打印下来数字，完成一次for三次嵌套
# print()  #换行
# print(f"打印次数为{count}")  #统计打印次数
#5.打印99乘法表
# for i in range(1,10):  #定义数字i
#     for j in range(1,10):  #定义数字2
#         if j <= i:   #除去1*2 ，1*3等杂鱼向
#             print(f"{i}*{j}={i*j}",end = " ") #打印 ，首先从i=1，进入内部循环j和条件判断if，判断完成后打印输出的值
#     print() #内部循坏完成后，换行，重新从外部循坏i=2开始进入内部循坏
# 6.计算所有水仙花的值  水仙花：三位数即 a**3+b**3*c**3=num
# count = 0 #统计水仙花数量
# for num in range(100,1000):  #num从100-1000中去值，同样包前不包后
#     a = num//100   # //表示整除直接取值，不考虑四舍五入， num//100表示百位数
#     b = (num//10)%10   #num//10 表示第一位数字为十位了，然后通过求余%10表示十位数，例如984//10=98（//不需要四舍五入）,98%10=8
#     c = num%10  # 求得余数即是个位数字，比如984%10=4
#     if num == a**3 + b**3 + c**3:  #判断是否符合条件
#         count += 1  #记录水仙花次数
#         print(a,b,c,sep = "",end = " ")# 打印水仙花数
# print() # 换行
# print(f"共有水仙花数{count}个")  #记录次数

for num in range(100,1000):
    a = num//100
    b = (num//10)%10
    c = num%10
    if a**3+b**3+c**3 == num:
        print(a,b,c,sep = '',end = ' ')


